# ConnectionValidationInfo Properties

---
The ConnectionValidationInfo type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace